/*
 * 程序名：打印13列7行的菱形两角
		      *
            * * * 
          * * * * *
        * * * * * * * 
      * * * * * * * * * 
    * * * * * * * * * * * 
  * * * * * * * * * * * * * 

 *   作者：姜宗谷
 *   时间：2023年3月10日
*/


#include<stdio.h>

int main()
{
	//打空格和行数
	int i = 0;
	for (; i<7 ; ++i)
	{
		//打印空格
		for (int k = 0; k <= 7-i; ++k)
			putchar(32);	//32是输出空格
		//打印列数
		for (int k = 0; k < 2 * (i+1) - 1; ++k)
			putchar('*');
		//打印换行
		putchar('\n');
	}

	return 0;
}