/*
 * 程序名：3、打印7列13行的菱形两角
		*
		* *
		* * *
		* * * *
		* * * * *
		* * * * * *
		* * * * * * *
		* * * * * *
		* * * * *
		* * * *
		* * *
		* *
		*
 *   作者：姜宗谷
 *   时间：2023年3月10日
*/

#include<stdio.h>

int main()
{
	int i = 0;
	for (; i <13; ++i)
	{
		
		
		if (i < 7)	//正着打上部分  下标：0-6
		{
			for (int j = 0; j <= i; j++)
			{
				putchar('*');
			}		
		}
		else   //反着打下部分	下标：0-5
		{
			for (int j = 0; j < (13 - i); ++j)
			{
				putchar('*');
			}
		}
		putchar('\n');
	}

}